#Задано дійсні позитивні числа a, b, c. Якщо існує трикутник зі сторонами a, b, c, то
#визначити його вид (прямокутний, гострокутний або тупокутний) і особливості
#(рівносторонній, рівнобедрений, різносторонній).
a = float(input("Введіть сторону трикутника a: "))
b = float(input("Введіть сторону трикутника b: "))
c = float(input("Введіть сторону трикутника c: "))

if a>=b and a>=c:#якщо найбільша сторона а
    max=a
    if max<b+c and max>abs(b-c):#якщо трикутник існує
        if a==b and b==c:
            print("Трикутний рівносторонній гострокутний")
        elif a==b or b==c or c==a:#рівнобедрений
            if max*max<b*b+c*c:
                print("рівнобедрений гострокутний")
            elif max*max==b*b+c*c:
                print("рівнобедрений прямокутний")
            else:
                print("рівнобедрений тупокутний")
        else:#різносторонній
            if max*max<b*b+c*c:
                print("різносторонній гострокутний")
            elif max*max==b*b+c*c:
                print("різносторонній прямокутний")
            else:
                print("різносторонній тупокутний")
    else:
        print("Трикутника з такими сторонами не існує!")
elif b>=a and b>=c:#найбільша сторона б
    max=b
    if max<a+c and max>abs(a-c):#якщо трикутник існує
        if a==b and b==c:
            print("Трикутний рівносторонній гострокутний")
        elif a==b or b==c or c==a:#рівнобедрений
            if max*max<a*a+c*c:
                print("рівнобедрений гострокутний")
            elif max*max==a*a+c*c:
                print("рівнобедрений прямокутний")
            else:
                print("рівнобедрений тупокутний")
        else:#різносторонній
            if max*max<a*a+c*c:
                print("різносторонній гострокутний")
            elif max*max==a*a+c*c:
                print("різносторонній прямокутний")
            else:
                print("різносторонній тупокутний")
    else:
        print("Трикутника з такими сторонами не існує!")
else:#найбільша сторона с
    max=c
    if max<b+a and max>abs(b-a):#якщо трикутник існує
        if a==b and b==c:
            print("Трикутний рівносторонній гострокутний")
        elif a==b or b==c or c==a:#рівнобедрений
            if max*max<b*b+a*a:
                print("рівнобедрений гострокутний")
            elif max*max==b*b+a*a:
                print("рівнобедрений прямокутний")
            else:
                print("рівнобедрений тупокутний")
        else:#різносторонній
            if max*max<b*b+a*a:
                print("різносторонній гострокутний")
            elif max*max==b*b+a*a:
                print("різносторонній прямокутний")
            else:
                print("різносторонній тупокутний")
    else:
        print("Трикутника з такими сторонами не існує!")